In [1]:
import numpy as np
import pandas as pd

In [18]:
array = np.array([(1.1,1.2,1.3,1.4,1.5,1.6), (2.1,2.2,2.3,2.4,2.5,2.6), (3.1,3.2,3.3,3.4,3.5,3.6), (4.1,4.2,4.3,4.4,4.5,4.6),
                 (5.1,5.2,5.3,5.4,5.5,5.6)])
array

array([[1.1, 1.2, 1.3, 1.4, 1.5, 1.6],
       [2.1, 2.2, 2.3, 2.4, 2.5, 2.6],
       [3.1, 3.2, 3.3, 3.4, 3.5, 3.6],
       [4.1, 4.2, 4.3, 4.4, 4.5, 4.6],
       [5.1, 5.2, 5.3, 5.4, 5.5, 5.6]])

In [24]:
df1 = pd.DataFrame(array,columns="U V W X Y Z".split(),index=['1','2','3','4','5'])
df1

     U    V    W    X    Y    Z
1  1.1  1.2  1.3  1.4  1.5  1.6
2  2.1  2.2  2.3  2.4  2.5  2.6
3  3.1  3.2  3.3  3.4  3.5  3.6
4  4.1  4.2  4.3  4.4  4.5  4.6
5  5.1  5.2  5.3  5.4  5.5  5.6

In [72]:
df1['Y']['1']*10

15.0

In [71]:
df1.loc['1']['Y']*10

15.0

In [70]:
df1.iloc[0][4]*10

15.0

In [67]:
df1.loc[['1','5'], ['W','U','Z']]

     W    U    Z
1  1.3  1.1  1.6
5  5.3  5.1  5.6

In [91]:
df1[['V','X']][(df1['W']<3)]

     V    X
1  1.2  1.4
2  2.2  2.4

In [94]:
df1[ (df1['X']>3) & (df1['Z']==5.6) & (df1['U'].notnull()) | (df1['W'].isnull())]

     U    V    W    X    Y    Z
5  5.1  5.2  5.3  5.4  5.5  5.6

In [41]:
df1[['W','X']].mean()

W    3.3
X    3.4
dtype: float64

In [49]:
df1.agg(['mean', 'max', 'min'])

        U    V    W    X    Y    Z
mean  3.1  3.2  3.3  3.4  3.5  3.6
max   5.1  5.2  5.3  5.4  5.5  5.6
min   1.1  1.2  1.3  1.4  1.5  1.6

In [50]:
df1[['V','Z']].agg(['mean', 'max', 'min'])

        V    Z
mean  3.2  3.6
max   5.2  5.6
min   1.2  1.6

In [133]:
df2 = pd.read_csv("D:/_meowppp/test/jupyter notebook/ProgressOfMyDataScience/test0212.csv")
df2

   no         name category  price
0   1      GamePad   widget  20.25
1   2  GameConsole   Device  59.99
2   3   GameScreen  Monitor  30.00
3   4      GameJoy   widget  19.75

In [136]:
df2['price'][3] = df2['price'][3] -4

D:\_meowppp\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [137]:
df2["vat"] = df2["price"]*0.07
df2["total"] = df2["price"]+df2["vat"]
df2

   no         name category  price     vat    total
0   1      GamePad   widget  20.25  1.4175  21.6675
1   2  GameConsole   Device  59.99  4.1993  64.1893
2   3   GameScreen  Monitor  30.00  2.1000  32.1000
3   4      GameJoy   widget  15.75  1.1025  16.8525

In [138]:
df2.groupby("name").mean()

             no  price     vat    total
name
GameConsole   2  59.99  4.1993  64.1893
GameJoy       4  15.75  1.1025  16.8525
GamePad       1  20.25  1.4175  21.6675
GameScreen    3  30.00  2.1000  32.1000

In [145]:
print(df2.groupby('category').groups)

{'Device': Int64Index([1], dtype='int64'), 'Monitor': Int64Index([2], dtype='int64'), 'widget': Int64Index([0, 3], dtype='int64')}

In [146]:
print(df2.groupby(['name','category']).groups)

{('GameConsole', 'Device'): Int64Index([1], dtype='int64'), ('GameJoy', 'widget'): Int64Index([3], dtype='int64'), ('GamePad', 'widget'): Int64Index([0], dtype='int64'), ('GameScreen', 'Monitor'): Int64Index([2], dtype='int64')}

In [139]:
df2.groupby("category").mean()

           no  price     vat    total
category
Device    2.0  59.99  4.1993  64.1893
Monitor   3.0  30.00  2.1000  32.1000
widget    2.5  18.00  1.2600  19.2600

In [143]:
df2[(df2['price']>20)].groupby("category").mean()

          no  price     vat    total
category
Device     2  59.99  4.1993  64.1893
Monitor    3  30.00  2.1000  32.1000
widget     1  20.25  1.4175  21.6675

In [147]:
df2[['category','total']][(df2['price']>20)].groupby("category").mean()

            total
category
Device    64.1893
Monitor   32.1000
widget    21.6675